class Constant {
  Map get dataDic => {
        "التزكية والتربية": [
          "طلب العلم وآدابه",
          "تزكية النفس",
          "الأخلاق والآداب",
          "سيَر ومناقب"
        ],
        "علوم اللغة": [
          "النحو",
          "الصرف",
          "البلاغة",
          "المفردات",
          "الأدب",
          "الإملاء"
        ],
        "القرآن وعلومه": ["علوم القرآن", "التجويد", "القراءات", "التفسير"],
        "السّنة وعلومها": ["علوم الحديث", "متون الحديث", "السيرة"],
        "العقيدة": ["أصول الدين"],
        "الفقه": [
          "الحنفي",
          "المالكي",
          "الشافعي",
          "الحنبلي",
          "الفرائض",
          "السياسة الشرعية",
          "القواعد والفروق الفقهية",
          "أحاديث الأحكام"
        ],
        "أصول الفقه وملحقاته": [
          "أصول الحنفي",
          "أصول المالكي",
          "أصول الشافعي",
          "أصول الحنبلي",
          "أصول البدع",
          "مقاصد الشريعة"
        ]
      };
}
